---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ViewSheetFailures.ViewOnASheetCannotBeUncropped3DPerspectiveView
source: html/59dd835d-d85b-8024-735e-9832e3506a40.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ViewSheetFailures.ViewOnASheetCannotBeUncropped3DPerspectiveView Property

Sheets do not support uncropped perspective views.

## Syntax (C#)
```csharp
public static FailureDefinitionId ViewOnASheetCannotBeUncropped3DPerspectiveView { get; }
```